; domain
(define (domain wumpus-world)
  (:requirements :adl :typing)
  (:types 
    location - object
    agent - object
    direction - object
  )
  
  (:predicates
    (at ?obj - object ?loc - location)
    (adjacent ?loc1 ?loc2 - location ?dir - direction)
    (has-arrow ?agent - agent)
    (has-key ?agent - agent)
    (wumpus ?loc - location)
    (wall ?loc - location)
    (crate ?loc - location)
    (trampoline ?loc - location)
    (door ?loc - location)
    (arrow ?loc - location)
    (key ?loc - location)
    (empty ?loc - location)
    (edge ?loc - location ?dir - direction)
    (free ?agent - agent)
  )

  (:action walk
    :parameters (?a - agent ?from - location ?to - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (adjacent ?from ?to ?dir)
      (not (wall ?to))
      (not (wumpus ?to))
      (not (door ?to))
      (not (crate ?to))
      (or (empty ?to) (arrow ?to) (key ?to) (trampoline ?to))
      (not (trampoline ?from))
    )
    :effect (and
      (not (at ?a ?from))
      (at ?a ?to)
      (when (arrow ?to) (has-arrow ?a))
      (when (arrow ?to) (not (arrow ?to)))
      (when (arrow ?to) (empty ?to))
      (when (key ?to) (has-key ?a))
      (when (key ?to) (not (key ?to)))
      (when (key ?to) (empty ?to))
    )
  )

  (:action walk-off-map
    :parameters (?a - agent ?from - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (edge ?from ?dir)
      (not (trampoline ?from))
    )
    :effect (and
      (not (at ?a ?from))
      (free ?a)
    )
  )

  (:action push
    :parameters (?a - agent ?from - location ?middle - location ?to - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (adjacent ?from ?middle ?dir)
      (adjacent ?middle ?to ?dir)
      (or (crate ?middle) (trampoline ?middle))
      (or (empty ?to) (arrow ?to) (key ?to))
    )
    :effect (and
      (not (at ?a ?from))
      (at ?a ?middle)
      (when (crate ?middle) (not (crate ?middle)))
      (when (crate ?middle) (crate ?to))
      (when (trampoline ?middle) (not (trampoline ?middle)))
      (when (trampoline ?middle) (trampoline ?to))
      (when (empty ?to) (not (empty ?to)))
      (when (arrow ?to) (has-arrow ?a))
      (when (arrow ?to) (not (arrow ?to)))
      (when (key ?to) (has-key ?a))
      (when (key ?to) (not (key ?to)))
      (empty ?middle)
    )
  )

  (:action shoot
    :parameters (?a - agent ?from - location ?to - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (adjacent ?from ?to ?dir)
      (has-arrow ?a)
      (wumpus ?to)
    )
    :effect (and
      (not (has-arrow ?a))
      (not (wumpus ?to))
      (empty ?to)
    )
  )

  (:action unlock
    :parameters (?a - agent ?from - location ?to - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (adjacent ?from ?to ?dir)
      (has-key ?a)
      (door ?to)
    )
    :effect (and
      (not (has-key ?a))
      (not (door ?to))
      (empty ?to)
    )
  )

  (:action jump
    :parameters (?a - agent ?from - location ?over - location ?to - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (trampoline ?from)
      (adjacent ?from ?over ?dir)
      (adjacent ?over ?to ?dir)
      (or (empty ?to) (arrow ?to) (key ?to))
      (not (wall ?over))
    )
    :effect (and
      (not (at ?a ?from))
      (at ?a ?to)
      (when (arrow ?to) (has-arrow ?a))
      (when (arrow ?to) (not (arrow ?to)))
      (when (arrow ?to) (empty ?to))
      (when (key ?to) (has-key ?a))
      (when (key ?to) (not (key ?to)))
      (when (key ?to) (empty ?to))
    )
  )

  (:action jump-off-map
    :parameters (?a - agent ?from - location ?over - location ?dir - direction)
    :precondition (and 
      (at ?a ?from)
      (trampoline ?from)
      (adjacent ?from ?over ?dir)
      (edge ?over ?dir)
      (not (wall ?over))
    )
    :effect (and
      (not (at ?a ?from))
      (free ?a)
    )
  )
)

; problem
(define (problem wumpus-escape-/mnt/c/Users/rider/Desktop/MsAI/Projects/AISys1/team660/maps/map034)
  (:domain wumpus-world)
  (:objects
    agent - agent
    loc-0-0 loc-0-1 loc-0-2 loc-0-3 loc-0-4 loc-0-5 loc-0-6 loc-0-7 loc-0-8 loc-0-9 loc-0-10 loc-0-11 loc-1-0 loc-1-1 loc-1-2 loc-1-3 loc-1-4 loc-1-5 loc-1-6 loc-1-7 loc-1-8 loc-1-9 loc-1-10 loc-1-11 loc-2-0 loc-2-1 loc-2-2 loc-2-3 loc-2-4 loc-2-5 loc-2-6 loc-2-7 loc-2-8 loc-2-9 loc-2-10 loc-2-11 loc-3-0 loc-3-1 loc-3-2 loc-3-3 loc-3-4 loc-3-5 loc-3-6 loc-3-7 loc-3-8 loc-3-9 loc-3-10 loc-3-11 loc-4-0 loc-4-1 loc-4-2 loc-4-3 loc-4-4 loc-4-5 loc-4-6 loc-4-7 loc-4-8 loc-4-9 loc-4-10 loc-4-11 loc-5-0 loc-5-1 loc-5-2 loc-5-3 loc-5-4 loc-5-5 loc-5-6 loc-5-7 loc-5-8 loc-5-9 loc-5-10 loc-5-11 loc-6-0 loc-6-1 loc-6-2 loc-6-3 loc-6-4 loc-6-5 loc-6-6 loc-6-7 loc-6-8 loc-6-9 loc-6-10 loc-6-11 loc-7-0 loc-7-1 loc-7-2 loc-7-3 loc-7-4 loc-7-5 loc-7-6 loc-7-7 loc-7-8 loc-7-9 loc-7-10 loc-7-11 - location
    north south east west - direction
  )
  (:init
    (adjacent loc-0-0 loc-1-0 south)
    (adjacent loc-0-0 loc-0-1 east)
    (adjacent loc-0-1 loc-1-1 south)
    (adjacent loc-0-1 loc-0-0 west)
    (adjacent loc-0-1 loc-0-2 east)
    (adjacent loc-0-2 loc-1-2 south)
    (adjacent loc-0-2 loc-0-1 west)
    (adjacent loc-0-2 loc-0-3 east)
    (adjacent loc-0-3 loc-1-3 south)
    (adjacent loc-0-3 loc-0-2 west)
    (adjacent loc-0-3 loc-0-4 east)
    (adjacent loc-0-4 loc-1-4 south)
    (adjacent loc-0-4 loc-0-3 west)
    (adjacent loc-0-4 loc-0-5 east)
    (adjacent loc-0-5 loc-1-5 south)
    (adjacent loc-0-5 loc-0-4 west)
    (adjacent loc-0-5 loc-0-6 east)
    (adjacent loc-0-6 loc-1-6 south)
    (adjacent loc-0-6 loc-0-5 west)
    (adjacent loc-0-6 loc-0-7 east)
    (adjacent loc-0-7 loc-1-7 south)
    (adjacent loc-0-7 loc-0-6 west)
    (adjacent loc-0-7 loc-0-8 east)
    (adjacent loc-0-8 loc-1-8 south)
    (adjacent loc-0-8 loc-0-7 west)
    (adjacent loc-0-8 loc-0-9 east)
    (adjacent loc-0-9 loc-1-9 south)
    (adjacent loc-0-9 loc-0-8 west)
    (adjacent loc-0-9 loc-0-10 east)
    (adjacent loc-0-10 loc-1-10 south)
    (adjacent loc-0-10 loc-0-9 west)
    (adjacent loc-0-10 loc-0-11 east)
    (adjacent loc-0-11 loc-1-11 south)
    (adjacent loc-0-11 loc-0-10 west)
    (adjacent loc-1-0 loc-0-0 north)
    (adjacent loc-1-0 loc-2-0 south)
    (adjacent loc-1-0 loc-1-1 east)
    (adjacent loc-1-1 loc-0-1 north)
    (adjacent loc-1-1 loc-2-1 south)
    (adjacent loc-1-1 loc-1-0 west)
    (adjacent loc-1-1 loc-1-2 east)
    (adjacent loc-1-2 loc-0-2 north)
    (adjacent loc-1-2 loc-2-2 south)
    (adjacent loc-1-2 loc-1-1 west)
    (adjacent loc-1-2 loc-1-3 east)
    (adjacent loc-1-3 loc-0-3 north)
    (adjacent loc-1-3 loc-2-3 south)
    (adjacent loc-1-3 loc-1-2 west)
    (adjacent loc-1-3 loc-1-4 east)
    (adjacent loc-1-4 loc-0-4 north)
    (adjacent loc-1-4 loc-2-4 south)
    (adjacent loc-1-4 loc-1-3 west)
    (adjacent loc-1-4 loc-1-5 east)
    (adjacent loc-1-5 loc-0-5 north)
    (adjacent loc-1-5 loc-2-5 south)
    (adjacent loc-1-5 loc-1-4 west)
    (adjacent loc-1-5 loc-1-6 east)
    (adjacent loc-1-6 loc-0-6 north)
    (adjacent loc-1-6 loc-2-6 south)
    (adjacent loc-1-6 loc-1-5 west)
    (adjacent loc-1-6 loc-1-7 east)
    (adjacent loc-1-7 loc-0-7 north)
    (adjacent loc-1-7 loc-2-7 south)
    (adjacent loc-1-7 loc-1-6 west)
    (adjacent loc-1-7 loc-1-8 east)
    (adjacent loc-1-8 loc-0-8 north)
    (adjacent loc-1-8 loc-2-8 south)
    (adjacent loc-1-8 loc-1-7 west)
    (adjacent loc-1-8 loc-1-9 east)
    (adjacent loc-1-9 loc-0-9 north)
    (adjacent loc-1-9 loc-2-9 south)
    (adjacent loc-1-9 loc-1-8 west)
    (adjacent loc-1-9 loc-1-10 east)
    (adjacent loc-1-10 loc-0-10 north)
    (adjacent loc-1-10 loc-2-10 south)
    (adjacent loc-1-10 loc-1-9 west)
    (adjacent loc-1-10 loc-1-11 east)
    (adjacent loc-1-11 loc-0-11 north)
    (adjacent loc-1-11 loc-2-11 south)
    (adjacent loc-1-11 loc-1-10 west)
    (adjacent loc-2-0 loc-1-0 north)
    (adjacent loc-2-0 loc-3-0 south)
    (adjacent loc-2-0 loc-2-1 east)
    (adjacent loc-2-1 loc-1-1 north)
    (adjacent loc-2-1 loc-3-1 south)
    (adjacent loc-2-1 loc-2-0 west)
    (adjacent loc-2-1 loc-2-2 east)
    (adjacent loc-2-2 loc-1-2 north)
    (adjacent loc-2-2 loc-3-2 south)
    (adjacent loc-2-2 loc-2-1 west)
    (adjacent loc-2-2 loc-2-3 east)
    (adjacent loc-2-3 loc-1-3 north)
    (adjacent loc-2-3 loc-3-3 south)
    (adjacent loc-2-3 loc-2-2 west)
    (adjacent loc-2-3 loc-2-4 east)
    (adjacent loc-2-4 loc-1-4 north)
    (adjacent loc-2-4 loc-3-4 south)
    (adjacent loc-2-4 loc-2-3 west)
    (adjacent loc-2-4 loc-2-5 east)
    (adjacent loc-2-5 loc-1-5 north)
    (adjacent loc-2-5 loc-3-5 south)
    (adjacent loc-2-5 loc-2-4 west)
    (adjacent loc-2-5 loc-2-6 east)
    (adjacent loc-2-6 loc-1-6 north)
    (adjacent loc-2-6 loc-3-6 south)
    (adjacent loc-2-6 loc-2-5 west)
    (adjacent loc-2-6 loc-2-7 east)
    (adjacent loc-2-7 loc-1-7 north)
    (adjacent loc-2-7 loc-3-7 south)
    (adjacent loc-2-7 loc-2-6 west)
    (adjacent loc-2-7 loc-2-8 east)
    (adjacent loc-2-8 loc-1-8 north)
    (adjacent loc-2-8 loc-3-8 south)
    (adjacent loc-2-8 loc-2-7 west)
    (adjacent loc-2-8 loc-2-9 east)
    (adjacent loc-2-9 loc-1-9 north)
    (adjacent loc-2-9 loc-3-9 south)
    (adjacent loc-2-9 loc-2-8 west)
    (adjacent loc-2-9 loc-2-10 east)
    (adjacent loc-2-10 loc-1-10 north)
    (adjacent loc-2-10 loc-3-10 south)
    (adjacent loc-2-10 loc-2-9 west)
    (adjacent loc-2-10 loc-2-11 east)
    (adjacent loc-2-11 loc-1-11 north)
    (adjacent loc-2-11 loc-3-11 south)
    (adjacent loc-2-11 loc-2-10 west)
    (adjacent loc-3-0 loc-2-0 north)
    (adjacent loc-3-0 loc-4-0 south)
    (adjacent loc-3-0 loc-3-1 east)
    (adjacent loc-3-1 loc-2-1 north)
    (adjacent loc-3-1 loc-4-1 south)
    (adjacent loc-3-1 loc-3-0 west)
    (adjacent loc-3-1 loc-3-2 east)
    (adjacent loc-3-2 loc-2-2 north)
    (adjacent loc-3-2 loc-4-2 south)
    (adjacent loc-3-2 loc-3-1 west)
    (adjacent loc-3-2 loc-3-3 east)
    (adjacent loc-3-3 loc-2-3 north)
    (adjacent loc-3-3 loc-4-3 south)
    (adjacent loc-3-3 loc-3-2 west)
    (adjacent loc-3-3 loc-3-4 east)
    (adjacent loc-3-4 loc-2-4 north)
    (adjacent loc-3-4 loc-4-4 south)
    (adjacent loc-3-4 loc-3-3 west)
    (adjacent loc-3-4 loc-3-5 east)
    (adjacent loc-3-5 loc-2-5 north)
    (adjacent loc-3-5 loc-4-5 south)
    (adjacent loc-3-5 loc-3-4 west)
    (adjacent loc-3-5 loc-3-6 east)
    (adjacent loc-3-6 loc-2-6 north)
    (adjacent loc-3-6 loc-4-6 south)
    (adjacent loc-3-6 loc-3-5 west)
    (adjacent loc-3-6 loc-3-7 east)
    (adjacent loc-3-7 loc-2-7 north)
    (adjacent loc-3-7 loc-4-7 south)
    (adjacent loc-3-7 loc-3-6 west)
    (adjacent loc-3-7 loc-3-8 east)
    (adjacent loc-3-8 loc-2-8 north)
    (adjacent loc-3-8 loc-4-8 south)
    (adjacent loc-3-8 loc-3-7 west)
    (adjacent loc-3-8 loc-3-9 east)
    (adjacent loc-3-9 loc-2-9 north)
    (adjacent loc-3-9 loc-4-9 south)
    (adjacent loc-3-9 loc-3-8 west)
    (adjacent loc-3-9 loc-3-10 east)
    (adjacent loc-3-10 loc-2-10 north)
    (adjacent loc-3-10 loc-4-10 south)
    (adjacent loc-3-10 loc-3-9 west)
    (adjacent loc-3-10 loc-3-11 east)
    (adjacent loc-3-11 loc-2-11 north)
    (adjacent loc-3-11 loc-4-11 south)
    (adjacent loc-3-11 loc-3-10 west)
    (adjacent loc-4-0 loc-3-0 north)
    (adjacent loc-4-0 loc-5-0 south)
    (adjacent loc-4-0 loc-4-1 east)
    (adjacent loc-4-1 loc-3-1 north)
    (adjacent loc-4-1 loc-5-1 south)
    (adjacent loc-4-1 loc-4-0 west)
    (adjacent loc-4-1 loc-4-2 east)
    (adjacent loc-4-2 loc-3-2 north)
    (adjacent loc-4-2 loc-5-2 south)
    (adjacent loc-4-2 loc-4-1 west)
    (adjacent loc-4-2 loc-4-3 east)
    (adjacent loc-4-3 loc-3-3 north)
    (adjacent loc-4-3 loc-5-3 south)
    (adjacent loc-4-3 loc-4-2 west)
    (adjacent loc-4-3 loc-4-4 east)
    (adjacent loc-4-4 loc-3-4 north)
    (adjacent loc-4-4 loc-5-4 south)
    (adjacent loc-4-4 loc-4-3 west)
    (adjacent loc-4-4 loc-4-5 east)
    (adjacent loc-4-5 loc-3-5 north)
    (adjacent loc-4-5 loc-5-5 south)
    (adjacent loc-4-5 loc-4-4 west)
    (adjacent loc-4-5 loc-4-6 east)
    (adjacent loc-4-6 loc-3-6 north)
    (adjacent loc-4-6 loc-5-6 south)
    (adjacent loc-4-6 loc-4-5 west)
    (adjacent loc-4-6 loc-4-7 east)
    (adjacent loc-4-7 loc-3-7 north)
    (adjacent loc-4-7 loc-5-7 south)
    (adjacent loc-4-7 loc-4-6 west)
    (adjacent loc-4-7 loc-4-8 east)
    (adjacent loc-4-8 loc-3-8 north)
    (adjacent loc-4-8 loc-5-8 south)
    (adjacent loc-4-8 loc-4-7 west)
    (adjacent loc-4-8 loc-4-9 east)
    (adjacent loc-4-9 loc-3-9 north)
    (adjacent loc-4-9 loc-5-9 south)
    (adjacent loc-4-9 loc-4-8 west)
    (adjacent loc-4-9 loc-4-10 east)
    (adjacent loc-4-10 loc-3-10 north)
    (adjacent loc-4-10 loc-5-10 south)
    (adjacent loc-4-10 loc-4-9 west)
    (adjacent loc-4-10 loc-4-11 east)
    (adjacent loc-4-11 loc-3-11 north)
    (adjacent loc-4-11 loc-5-11 south)
    (adjacent loc-4-11 loc-4-10 west)
    (adjacent loc-5-0 loc-4-0 north)
    (adjacent loc-5-0 loc-6-0 south)
    (adjacent loc-5-0 loc-5-1 east)
    (adjacent loc-5-1 loc-4-1 north)
    (adjacent loc-5-1 loc-6-1 south)
    (adjacent loc-5-1 loc-5-0 west)
    (adjacent loc-5-1 loc-5-2 east)
    (adjacent loc-5-2 loc-4-2 north)
    (adjacent loc-5-2 loc-6-2 south)
    (adjacent loc-5-2 loc-5-1 west)
    (adjacent loc-5-2 loc-5-3 east)
    (adjacent loc-5-3 loc-4-3 north)
    (adjacent loc-5-3 loc-6-3 south)
    (adjacent loc-5-3 loc-5-2 west)
    (adjacent loc-5-3 loc-5-4 east)
    (adjacent loc-5-4 loc-4-4 north)
    (adjacent loc-5-4 loc-6-4 south)
    (adjacent loc-5-4 loc-5-3 west)
    (adjacent loc-5-4 loc-5-5 east)
    (adjacent loc-5-5 loc-4-5 north)
    (adjacent loc-5-5 loc-6-5 south)
    (adjacent loc-5-5 loc-5-4 west)
    (adjacent loc-5-5 loc-5-6 east)
    (adjacent loc-5-6 loc-4-6 north)
    (adjacent loc-5-6 loc-6-6 south)
    (adjacent loc-5-6 loc-5-5 west)
    (adjacent loc-5-6 loc-5-7 east)
    (adjacent loc-5-7 loc-4-7 north)
    (adjacent loc-5-7 loc-6-7 south)
    (adjacent loc-5-7 loc-5-6 west)
    (adjacent loc-5-7 loc-5-8 east)
    (adjacent loc-5-8 loc-4-8 north)
    (adjacent loc-5-8 loc-6-8 south)
    (adjacent loc-5-8 loc-5-7 west)
    (adjacent loc-5-8 loc-5-9 east)
    (adjacent loc-5-9 loc-4-9 north)
    (adjacent loc-5-9 loc-6-9 south)
    (adjacent loc-5-9 loc-5-8 west)
    (adjacent loc-5-9 loc-5-10 east)
    (adjacent loc-5-10 loc-4-10 north)
    (adjacent loc-5-10 loc-6-10 south)
    (adjacent loc-5-10 loc-5-9 west)
    (adjacent loc-5-10 loc-5-11 east)
    (adjacent loc-5-11 loc-4-11 north)
    (adjacent loc-5-11 loc-6-11 south)
    (adjacent loc-5-11 loc-5-10 west)
    (adjacent loc-6-0 loc-5-0 north)
    (adjacent loc-6-0 loc-7-0 south)
    (adjacent loc-6-0 loc-6-1 east)
    (adjacent loc-6-1 loc-5-1 north)
    (adjacent loc-6-1 loc-7-1 south)
    (adjacent loc-6-1 loc-6-0 west)
    (adjacent loc-6-1 loc-6-2 east)
    (adjacent loc-6-2 loc-5-2 north)
    (adjacent loc-6-2 loc-7-2 south)
    (adjacent loc-6-2 loc-6-1 west)
    (adjacent loc-6-2 loc-6-3 east)
    (adjacent loc-6-3 loc-5-3 north)
    (adjacent loc-6-3 loc-7-3 south)
    (adjacent loc-6-3 loc-6-2 west)
    (adjacent loc-6-3 loc-6-4 east)
    (adjacent loc-6-4 loc-5-4 north)
    (adjacent loc-6-4 loc-7-4 south)
    (adjacent loc-6-4 loc-6-3 west)
    (adjacent loc-6-4 loc-6-5 east)
    (adjacent loc-6-5 loc-5-5 north)
    (adjacent loc-6-5 loc-7-5 south)
    (adjacent loc-6-5 loc-6-4 west)
    (adjacent loc-6-5 loc-6-6 east)
    (adjacent loc-6-6 loc-5-6 north)
    (adjacent loc-6-6 loc-7-6 south)
    (adjacent loc-6-6 loc-6-5 west)
    (adjacent loc-6-6 loc-6-7 east)
    (adjacent loc-6-7 loc-5-7 north)
    (adjacent loc-6-7 loc-7-7 south)
    (adjacent loc-6-7 loc-6-6 west)
    (adjacent loc-6-7 loc-6-8 east)
    (adjacent loc-6-8 loc-5-8 north)
    (adjacent loc-6-8 loc-7-8 south)
    (adjacent loc-6-8 loc-6-7 west)
    (adjacent loc-6-8 loc-6-9 east)
    (adjacent loc-6-9 loc-5-9 north)
    (adjacent loc-6-9 loc-7-9 south)
    (adjacent loc-6-9 loc-6-8 west)
    (adjacent loc-6-9 loc-6-10 east)
    (adjacent loc-6-10 loc-5-10 north)
    (adjacent loc-6-10 loc-7-10 south)
    (adjacent loc-6-10 loc-6-9 west)
    (adjacent loc-6-10 loc-6-11 east)
    (adjacent loc-6-11 loc-5-11 north)
    (adjacent loc-6-11 loc-7-11 south)
    (adjacent loc-6-11 loc-6-10 west)
    (adjacent loc-7-0 loc-6-0 north)
    (adjacent loc-7-0 loc-7-1 east)
    (adjacent loc-7-1 loc-6-1 north)
    (adjacent loc-7-1 loc-7-0 west)
    (adjacent loc-7-1 loc-7-2 east)
    (adjacent loc-7-2 loc-6-2 north)
    (adjacent loc-7-2 loc-7-1 west)
    (adjacent loc-7-2 loc-7-3 east)
    (adjacent loc-7-3 loc-6-3 north)
    (adjacent loc-7-3 loc-7-2 west)
    (adjacent loc-7-3 loc-7-4 east)
    (adjacent loc-7-4 loc-6-4 north)
    (adjacent loc-7-4 loc-7-3 west)
    (adjacent loc-7-4 loc-7-5 east)
    (adjacent loc-7-5 loc-6-5 north)
    (adjacent loc-7-5 loc-7-4 west)
    (adjacent loc-7-5 loc-7-6 east)
    (adjacent loc-7-6 loc-6-6 north)
    (adjacent loc-7-6 loc-7-5 west)
    (adjacent loc-7-6 loc-7-7 east)
    (adjacent loc-7-7 loc-6-7 north)
    (adjacent loc-7-7 loc-7-6 west)
    (adjacent loc-7-7 loc-7-8 east)
    (adjacent loc-7-8 loc-6-8 north)
    (adjacent loc-7-8 loc-7-7 west)
    (adjacent loc-7-8 loc-7-9 east)
    (adjacent loc-7-9 loc-6-9 north)
    (adjacent loc-7-9 loc-7-8 west)
    (adjacent loc-7-9 loc-7-10 east)
    (adjacent loc-7-10 loc-6-10 north)
    (adjacent loc-7-10 loc-7-9 west)
    (adjacent loc-7-10 loc-7-11 east)
    (adjacent loc-7-11 loc-6-11 north)
    (adjacent loc-7-11 loc-7-10 west)
    (wall loc-0-0)
    (empty loc-0-1)
    (crate loc-0-2)
    (crate loc-0-3)
    (crate loc-0-4)
    (empty loc-0-5)
    (wall loc-0-6)
    (wall loc-0-7)
    (crate loc-0-8)
    (crate loc-0-9)
    (wall loc-0-10)
    (wall loc-0-11)
    (crate loc-1-0)
    (wall loc-1-1)
    (empty loc-1-2)
    (wall loc-1-3)
    (wall loc-1-4)
    (crate loc-1-5)
    (crate loc-1-6)
    (wall loc-1-7)
    (empty loc-1-8)
    (crate loc-1-9)
    (crate loc-1-10)
    (crate loc-1-11)
    (crate loc-2-0)
    (crate loc-2-1)
    (crate loc-2-2)
    (wall loc-2-3)
    (wall loc-2-4)
    (crate loc-2-5)
    (wall loc-2-6)
    (empty loc-2-7)
    (wall loc-2-8)
    (empty loc-2-9)
    (wall loc-2-10)
    (empty loc-2-11)
    (crate loc-3-0)
    (wall loc-3-1)
    (wall loc-3-2)
    (crate loc-3-3)
    (wall loc-3-4)
    (wall loc-3-5)
    (crate loc-3-6)
    (crate loc-3-7)
    (empty loc-3-8)
    (crate loc-3-9)
    (wall loc-3-10)
    (crate loc-3-11)
    (empty loc-4-0)
    (empty loc-4-1)
    (empty loc-4-2)
    (empty loc-4-3)
    (empty loc-4-4)
    (empty loc-4-5)
    (crate loc-4-6)
    (empty loc-4-7)
    (at agent loc-4-8)
    (empty loc-4-8)
    (crate loc-4-9)
    (wall loc-4-10)
    (crate loc-4-11)
    (empty loc-5-0)
    (crate loc-5-1)
    (empty loc-5-2)
    (crate loc-5-3)
    (empty loc-5-4)
    (wall loc-5-5)
    (wall loc-5-6)
    (wall loc-5-7)
    (crate loc-5-8)
    (empty loc-5-9)
    (wall loc-5-10)
    (empty loc-5-11)
    (empty loc-6-0)
    (wall loc-6-1)
    (wall loc-6-2)
    (empty loc-6-3)
    (wall loc-6-4)
    (crate loc-6-5)
    (empty loc-6-6)
    (crate loc-6-7)
    (crate loc-6-8)
    (empty loc-6-9)
    (wall loc-6-10)
    (wall loc-6-11)
    (crate loc-7-0)
    (wall loc-7-1)
    (wall loc-7-2)
    (empty loc-7-3)
    (wall loc-7-4)
    (wall loc-7-5)
    (wall loc-7-6)
    (wall loc-7-7)
    (crate loc-7-8)
    (crate loc-7-9)
    (empty loc-7-10)
    (empty loc-7-11)
    (edge loc-0-0 west)
    (edge loc-0-11 east)
    (edge loc-1-0 west)
    (edge loc-1-11 east)
    (edge loc-2-0 west)
    (edge loc-2-11 east)
    (edge loc-3-0 west)
    (edge loc-3-11 east)
    (edge loc-4-0 west)
    (edge loc-4-11 east)
    (edge loc-5-0 west)
    (edge loc-5-11 east)
    (edge loc-6-0 west)
    (edge loc-6-11 east)
    (edge loc-7-0 west)
    (edge loc-7-11 east)
    (edge loc-0-0 north)
    (edge loc-7-0 south)
    (edge loc-0-1 north)
    (edge loc-7-1 south)
    (edge loc-0-2 north)
    (edge loc-7-2 south)
    (edge loc-0-3 north)
    (edge loc-7-3 south)
    (edge loc-0-4 north)
    (edge loc-7-4 south)
    (edge loc-0-5 north)
    (edge loc-7-5 south)
    (edge loc-0-6 north)
    (edge loc-7-6 south)
    (edge loc-0-7 north)
    (edge loc-7-7 south)
    (edge loc-0-8 north)
    (edge loc-7-8 south)
    (edge loc-0-9 north)
    (edge loc-7-9 south)
    (edge loc-0-10 north)
    (edge loc-7-10 south)
    (edge loc-0-11 north)
    (edge loc-7-11 south)
  )
  (:goal (free agent))
)

; plan
1. (walk agent loc-4-8 loc-4-7 west)
   deleted: (at agent loc-4-8)
   added: (at agent loc-4-7)
   goals met: 0 of 1
2. (push agent loc-4-7 loc-4-6 loc-4-5 west)
   deleted: (at agent loc-4-7) (crate loc-4-6) (empty loc-4-5)
   added: (at agent loc-4-6) (crate loc-4-5) (empty loc-4-6)
   goals met: 0 of 1
3. (push agent loc-4-6 loc-4-5 loc-4-4 west)
   deleted: (at agent loc-4-6) (crate loc-4-5) (empty loc-4-4)
   added: (at agent loc-4-5) (crate loc-4-4) (empty loc-4-5)
   goals met: 0 of 1
4. (push agent loc-4-5 loc-4-4 loc-4-3 west)
   deleted: (at agent loc-4-5) (crate loc-4-4) (empty loc-4-3)
   added: (at agent loc-4-4) (crate loc-4-3) (empty loc-4-4)
   goals met: 0 of 1
5. (push agent loc-4-4 loc-4-3 loc-4-2 west)
   deleted: (at agent loc-4-4) (crate loc-4-3) (empty loc-4-2)
   added: (at agent loc-4-3) (crate loc-4-2) (empty loc-4-3)
   goals met: 0 of 1
6. (push agent loc-4-3 loc-5-3 loc-6-3 south)
   deleted: (at agent loc-4-3) (crate loc-5-3) (empty loc-6-3)
   added: (at agent loc-5-3) (crate loc-6-3) (empty loc-5-3)
   goals met: 0 of 1
7. (push agent loc-5-3 loc-6-3 loc-7-3 south)
   deleted: (at agent loc-5-3) (crate loc-6-3) (empty loc-7-3)
   added: (at agent loc-6-3) (crate loc-7-3) (empty loc-6-3)
   goals met: 0 of 1
8. (walk agent loc-6-3 loc-5-3 north)
   deleted: (at agent loc-6-3)
   added: (at agent loc-5-3)
   goals met: 0 of 1
9. (walk agent loc-5-3 loc-5-2 west)
   deleted: (at agent loc-5-3)
   added: (at agent loc-5-2)
   goals met: 0 of 1
10. (push agent loc-5-2 loc-5-1 loc-5-0 west)
   deleted: (at agent loc-5-2) (crate loc-5-1) (empty loc-5-0)
   added: (at agent loc-5-1) (crate loc-5-0) (empty loc-5-1)
   goals met: 0 of 1
11. (walk agent loc-5-1 loc-4-1 north)
   deleted: (at agent loc-5-1)
   added: (at agent loc-4-1)
   goals met: 0 of 1
12. (walk agent loc-4-1 loc-4-0 west)
   deleted: (at agent loc-4-1)
   added: (at agent loc-4-0)
   goals met: 0 of 1
13. (walk-off-map agent loc-4-0 west)
   deleted: (at agent loc-4-0)
   added: (free agent)
   goals met: 1 of 1
